In [1]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\sudip\anaconda3\lib\site-packages (8.0.28)
Requirement already satisfied: protobuf>=3.0.0 in c:\users\sudip\anaconda3\lib\site-packages (from mysql-connector-python) (3.19.4)

In [1]:
import mysql.connector as conn

In [2]:
mydb = conn.connect(host = "localhost", user = "root", passwd = "mysql")

In [3]:
cursor = mydb.cursor()

In [4]:
cursor.execute('show databases')

In [5]:
cursor.fetchall()

[('assim_sql',),
 ('bestman',),
 ('cardata',),
 ('cardataset',),
 ('glassdata',),
 ('icardata',),
 ('information_schema',),
 ('kumari',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('student',),
 ('suman',),
 ('sys',),
 ('testcav',),
 ('testsud',),
 ('testsudh',),
 ('testsudhineuron',),
 ('testsus',),
 ('world',)]

In [32]:
cursor.execute('use assim_sql')

In [33]:
cursor.execute('SELECT * FROM worker_table')

In [34]:
cursor.fetchall()

[(1, 'Mukesh shrestha', 'Top level', 230000),
 (2, 'Sabita Malla', 'Account', 55000),
 (3, 'Binay Panjiyar', 'Account', 41000),
 (4, 'Sujan Joshi', 'Cash', 63000),
 (5, 'Ram Shah', 'Driver', 32500),
 (6, 'Hari Lama', 'Marketing', 115300),
 (7, 'Bishal Kumar', 'Top level', 215000),
 (8, 'Kavi Bhatari', 'Top level', 215000),
 (9, 'Amitabh Bhata', 'CEO', 350000)]

In [11]:
"""Assignment_2"""

'Assignment_2'

In [17]:
"""Q-1. Write an SQL query to print the first three characters of  FIRST_NAME from Worker
table."""

cursor.execute('SELECT SUBSTRING(First_Name, 1, 3) AS 1st_3_char FROM worker_table')
cursor.fetchall()

[('Muk',),
 ('Sab',),
 ('Bin',),
 ('Suj',),
 ('Ram',),
 ('Har',),
 ('Bis',),
 ('Kav',)]

In [18]:
cursor.execute('INSERT INTO worker_table VALUE(9, "Amitabh Bhata", "CEO")')

In [35]:
mydb.commit()

In [39]:
"""Q-2. Write an SQL query to find the position of the alphabet (‘a’) in the first name
column ‘Amitabh’ from Worker table."""

# cursor.execute('SELECT POSITION("a" IN First_Name) AS Name FROM worker_table')
# cursor.fetchall()
cursor.execute('SELECT POSITION("a" IN "Amitabh") AS Name')
cursor.fetchall()

[(1,)]

In [44]:
cursor.execute('SELECT First_Name, POSITION("a" IN First_Name) AS Name FROM worker_table')
cursor.fetchall()

[('Mukesh shrestha', 15),
 ('Sabita Malla', 2),
 ('Binay Panjiyar', 4),
 ('Sujan Joshi', 4),
 ('Ram Shah', 2),
 ('Hari Lama', 2),
 ('Bishal Kumar', 5),
 ('Kavi Bhatari', 2),
 ('Amitabh Bhata', 1)]

In [ ]:
cursor.execute('ALTER TABLE worker_table ADD Salary INT NOT NULL')
mydb.commit()

In [29]:
cursor.execute('UPDATE worker_table SET Salary = 350000 WHERE Id = 9')

In [38]:
"""Q-3. Write an SQL query to print the name of employees having the highest salary in each
department."""

cursor.execute('SELECT First_Name, Department, Salary FROM worker_Table GROUP BY Department HAVING MAX(Salary)')
cursor.fetchall()

[('Mukesh shrestha', 'Top level', 230000),
 ('Sabita Malla', 'Account', 55000),
 ('Sujan Joshi', 'Cash', 63000),
 ('Ram Shah', 'Driver', 32500),
 ('Hari Lama', 'Marketing', 115300),
 ('Amitabh Bhata', 'CEO', 350000)]

In [37]:
cursor.execute('SELECT * FROM worker_table')
cursor.fetchall()

[(1, 'Mukesh shrestha', 'Top level', 230000),
 (2, 'Sabita Malla', 'Account', 55000),
 (3, 'Binay Panjiyar', 'Account', 41000),
 (4, 'Sujan Joshi', 'Cash', 63000),
 (5, 'Ram Shah', 'Driver', 32500),
 (6, 'Hari Lama', 'Marketing', 115300),
 (7, 'Bishal Kumar', 'Top level', 215000),
 (8, 'Kavi Bhatari', 'Top level', 215000),
 (9, 'Amitabh Bhata', 'CEO', 350000)]